<center><h1>loc & iloc</h1></center> <br>
<h3>We use loc & iloc function for selecting desired data</h3> <br>

loc Vs iloc <br>
loc -  We can access row and columns through proper names. <br>
iloc - We can access row and columns through numbers. <br>

In [1]:
import pandas as pd

In [2]:
f = pd.read_csv('E:\Coding Tutorials\Jupyter Tutorial\Machine Learning Tutorials\Tutorialcsvdata\Tut32.csv')
f

   Student_ID  Class  Study_hrs  Percentage
0        1001     10          2          50
1        1002     10          6          80
2        1003     10          3          60
3        1004     11          0          45
4        1005     12          5          75

In [3]:
f.loc[0]                                                       # Print 0th index data using list

Student_ID    1001
Class           10
Study_hrs        2
Percentage      50
Name: 0, dtype: int64

In [4]:
f.loc[4]                                                       # Print 4th index data using list

Student_ID    1005
Class           12
Study_hrs        5
Percentage      75
Name: 4, dtype: int64

In [5]:
f.loc[[4]]                                                    # print 4th index data using list of list with proper format

   Student_ID  Class  Study_hrs  Percentage
4        1005     12          5          75

In [6]:
f.loc[[0,1]]                                                  # print index 0 & 1 using list of list

   Student_ID  Class  Study_hrs  Percentage
0        1001     10          2          50
1        1002     10          6          80

In [7]:
f.loc[[3,4]]                                                  # print index 3 & 4 using list of list

   Student_ID  Class  Study_hrs  Percentage
3        1004     11          0          45
4        1005     12          5          75

# Print specific value of specific column

In [8]:
f

   Student_ID  Class  Study_hrs  Percentage
0        1001     10          2          50
1        1002     10          6          80
2        1003     10          3          60
3        1004     11          0          45
4        1005     12          5          75

In [9]:
f.loc[4,'Percentage']                                       # Access percentage value im 4th index

75

In [10]:
f.loc[3,'Class']                                           # Access class value of 3th index

11

In [11]:
f.loc[3,'Student_ID']                                       # stu_id value of 4t index

1004

# Slicing

In [12]:
f.loc[0:3]

   Student_ID  Class  Study_hrs  Percentage
0        1001     10          2          50
1        1002     10          6          80
2        1003     10          3          60
3        1004     11          0          45

In [13]:
f.loc[2:4]

   Student_ID  Class  Study_hrs  Percentage
2        1003     10          3          60
3        1004     11          0          45
4        1005     12          5          75

In [14]:
f.loc[0:1,'Student_ID']                                      # Slice Specific index of any column

0    1001
1    1002
Name: Student_ID, dtype: int64

In [15]:
f.loc[1:4,'Percentage']

1    80
2    60
3    45
4    75
Name: Percentage, dtype: int64

In [16]:
f.loc[:,'Class']

0    10
1    10
2    10
3    11
4    12
Name: Class, dtype: int64

In [17]:
f.loc[1:3,:]

   Student_ID  Class  Study_hrs  Percentage
1        1002     10          6          80
2        1003     10          3          60
3        1004     11          0          45

# Conditional Operators

In [18]:
f

   Student_ID  Class  Study_hrs  Percentage
0        1001     10          2          50
1        1002     10          6          80
2        1003     10          3          60
3        1004     11          0          45
4        1005     12          5          75

In [19]:
f.loc[f['Class'] <12]

   Student_ID  Class  Study_hrs  Percentage
0        1001     10          2          50
1        1002     10          6          80
2        1003     10          3          60
3        1004     11          0          45

In [20]:
f.loc[f['Student_ID']>1003 , 'Percentage']                              # Print percentage col. where id greater than 1003

3    45
4    75
Name: Percentage, dtype: int64

<center><h1>iloc(Interger locaton-based indexing)</h1></iloc> <br>
By using iloc we can access row/col  through numbers <br>
Syntax - DataFrame.iloc[]

In [21]:
f

   Student_ID  Class  Study_hrs  Percentage
0        1001     10          2          50
1        1002     10          6          80
2        1003     10          3          60
3        1004     11          0          45
4        1005     12          5          75

In [22]:
f.iloc[0]                                                                   # Print 0 row with all col

Student_ID    1001
Class           10
Study_hrs        2
Percentage      50
Name: 0, dtype: int64

In [23]:
f.iloc[[0]]                                                                 # Print 0 row with all col with proper form

   Student_ID  Class  Study_hrs  Percentage
0        1001     10          2          50

In [24]:
f.iloc[:,1]

0    10
1    10
2    10
3    11
4    12
Name: Class, dtype: int64

In [25]:
f.iloc[0,1]

10

In [26]:
f.iloc[[0,3]]

   Student_ID  Class  Study_hrs  Percentage
0        1001     10          2          50
3        1004     11          0          45

In [27]:
f

   Student_ID  Class  Study_hrs  Percentage
0        1001     10          2          50
1        1002     10          6          80
2        1003     10          3          60
3        1004     11          0          45
4        1005     12          5          75

In [28]:
f.iloc[0:2 , 0:4]

   Student_ID  Class  Study_hrs  Percentage
0        1001     10          2          50
1        1002     10          6          80

In [29]:
f.iloc[2:4 , 1:3]

   Class  Study_hrs
2     10          3
3     11          0

In [30]:
f.index=['A' , 'B' , 'C' , 'D' , 'E']                                      # Chnage index name of csv file

In [31]:
f

   Student_ID  Class  Study_hrs  Percentage
A        1001     10          2          50
B        1002     10          6          80
C        1003     10          3          60
D        1004     11          0          45
E        1005     12          5          75

In [34]:
f.columns=['StuId' , 'class', 'stdy' , 'Percen']                           # Change column name of csv file
f

   StuId  class  stdy  Percen
A   1001     10     2      50
B   1002     10     6      80
C   1003     10     3      60
D   1004     11     0      45
E   1005     12     5      75

In [35]:
f.to_csv('new.csv')                                                       # Read f data in new.csv file